{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 16], "dtype": "float32", "sparse": false, "ragged": false, "name": "character_input"}, "name": "character_input", "inbound_nodes": []}, {"class_name": "TimeDistributed", "config": {"name": "character_embedding", "trainable": true, "dtype": "float32", "layer": {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, 16], "dtype": "float32", "input_dim": 87, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 16}}}, "name": "character_embedding", "inbound_nodes": [[["character_input", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "word_input"}, "name": "word_input", "inbound_nodes": []}, {"class_name": "TimeDistributed", "config": {"name": "1d_character_convolution", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "1d_character_convolution", "inbound_nodes": [[["character_embedding", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "word_embedding", "trainable": false, "batch_input_shape": [null, 64], "dtype": "float32", "input_dim": 17723, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 64}, "name": "word_embedding", "inbound_nodes": [[["word_input", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "global_max_pooling", "trainable": true, "dtype": "float32", "layer": {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}}, "name": "global_max_pooling", "inbound_nodes": [[["1d_character_convolution", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenation", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenation", "inbound_nodes": [[["word_embedding", 0, 0, {}], ["global_max_pooling", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bi_lstm", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 112, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bi_lstm", "inbound_nodes": [[["concatenation", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "dense", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 176, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "dense", "inbound_nodes": [[["bi_lstm", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dense_dropout", "trainable": true, "dtype": "float32", "rate": 0.44999999999999996, "noise_shape": null, "seed": null}, "name": "dense_dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "mask_input"}, "name": "mask_input", "inbound_nodes": []}, {"class_name": "TimeDistributed", "config": {"name": "output", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 9, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "output", "inbound_nodes": [[["dense_dropout", 0, 0, {"mask": ["mask_input", 0, 0]}]]]}], "input_layers": [["word_input", 0, 0], ["character_input", 0, 0], ["mask_input", 0, 0]], "output_layers": [["output", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": null, "weighted_metrics": ["sparse_categorical_crossentropy", "sparse_categorical_accuracy"], "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0005000000237487257, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "1d_character_convolution/kernel", "shape": [4, 32, 48], "dtype": "float32"}, {"name": "1d_character_convolution/bias", "shape": [48], "dtype": "float32"}, {"name": "bi_lstm/forward_lstm/lstm_cell_1/kernel", "shape": [148, 448], "dtype": "float32"}, {"name": "bi_lstm/forward_lstm/lstm_cell_1/recurrent_kernel", "shape": [112, 448], "dtype": "float32"}, {"name": "bi_lstm/forward_lstm/lstm_cell_1/bias", "shape": [448], "dtype": "float32"}, {"name": "bi_lstm/backward_lstm/lstm_cell_2/kernel", "shape": [148, 448], "dtype": "float32"}, {"name": "bi_lstm/backward_lstm/lstm_cell_2/recurrent_kernel", "shape": [112, 448], "dtype": "float32"}, {"name": "bi_lstm/backward_lstm/lstm_cell_2/bias", "shape": [448], "dtype": "float32"}, {"name": "character_embedding/embeddings", "shape": [87, 32], "dtype": "float32"}, {"name": "dense/kernel", "shape": [224, 176], "dtype": "float32"}, {"name": "dense/bias", "shape": [176], "dtype": "float32"}, {"name": "output/kernel", "shape": [176, 9], "dtype": "float32"}, {"name": "output/bias", "shape": [9], "dtype": "float32"}, {"name": "word_embedding/embeddings", "shape": [17723, 100], "dtype": "float32"}]}]}